DataProcessors/Телефония.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>Телефония</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПользовательскиеНастройкиТелефонии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ПользовательскиеНастройкиТелефонии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонияВключена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктивироватьЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеВыводитьВнутренниеЗвонки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогСохраненияЛоговТелефонии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Телефония/Forms/НастройкиТелефонии/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = Не УправлениеТелефониейСервер.ПолучитьИспользованиеТелефонии();
	Если Не Отказ Тогда
		ЗаполнитьНастройкиТелефонии();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбработкаСтатусаТелефонии();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеСтатусаТелефонии" Тогда 
		ОбработкаСтатусаТелефонии();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти   

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПускКомпоненты(Команда)
	
	глТелефония["Зарегистрирована"] = УправлениеТелефониейКлиент.РегистрацияКомпонентыТелефонии();
	Если глТелефония["Зарегистрирована"] Тогда
		УправлениеТелефониейКлиент.ОпределитьУстановитьНастройкиТелефонии();
	КонецЕсли;
	Оповестить("ИзменениеСтатусаТелефонии");
	
КонецПроцедуры

&НаКлиенте
Процедура СтартТелефонии(Команда)
	УправлениеТелефониейКлиент.ВключитьТелефонию();	
КонецПроцедуры

&НаКлиенте
Процедура СтопТелефонии(Команда)
	УправлениеТелефониейКлиент.ВыключитьТелефонию();	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьНастройкиНаСервере();
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаМенеджеру", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Внимание! Для корректной работы требуется перезапуск приложения. Перезапустить сейчас?", РежимДиалогаВопрос.ДаНет, 0); 		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаСтатусаТелефонии()
	
	ЭтаФорма.Загружена = глТелефония["Зарегистрирована"];  
	ЭтаФорма.Инициализирована = глТелефония["Активирована"];
	Элементы.ПускКомпоненты.Доступность = НЕ глТелефония["Зарегистрирована"];
	ТекущийСтатус = УправлениеТелефониейКлиент.ПолучитьСтатусТелефонии();
	Если ТекущийСтатус = "Есть подключение" Тогда 
		Элементы.НадписьСтатусТелефонии.Заголовок = ТекущийСтатус;
		Элементы.СтартТелефонии.Доступность = Ложь;
		Элементы.СтопТелефонии.Доступность = Истина;
	ИначеЕсли ТекущийСтатус = "Нет подключения" Тогда 
		Элементы.НадписьСтатусТелефонии.Заголовок = ТекущийСтатус;
		Элементы.СтартТелефонии.Доступность = Истина;
		Элементы.СтопТелефонии.Доступность = Ложь;
	КонецЕсли;
	
	Лог = ?(Не ПустаяСтрока(глТелефония["СтартСообщение"]), "СтартСообщение: " + глТелефония["СтартСообщение"], ?(Не ПустаяСтрока(глТелефония["СтопСообщение"]), "СтопСообщение: " + глТелефония["СтопСообщение"], ""));
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНастройкиТелефонии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользовательскиеНастройкиТелефонии.Пользователь КАК Пользователь,
	|	ПользовательскиеНастройкиТелефонии.Использование КАК Использование,
	|	ПользовательскиеНастройкиТелефонии.ТелефонияВключена КАК ТелефонияВключена,
	|	ПользовательскиеНастройкиТелефонии.АктивироватьЛог КАК АктивироватьЛог,
	|	ПользовательскиеНастройкиТелефонии.ТекущийНомерТелефона КАК ТекущийНомерТелефона,
	|	ПользовательскиеНастройкиТелефонии.Логин КАК Логин,
	|	ПользовательскиеНастройкиТелефонии.НеВыводитьВнутренниеЗвонки КАК НеВыводитьВнутренниеЗвонки,
	|	ПользовательскиеНастройкиТелефонии.КаталогСохраненияЛоговТелефонии КАК КаталогСохраненияЛоговТелефонии,
	|	ПользовательскиеНастройкиТелефонии.ДатаАктивации КАК ДатаАктивации
	|ИЗ
	|	РегистрСведений.ПользовательскиеНастройкиТелефонии КАК ПользовательскиеНастройкиТелефонии
	|ГДЕ
	|	ПользовательскиеНастройкиТелефонии.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.АвторизованныйПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, ВыборкаДетальныеЗаписи);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();	
	Для каждого РеквизитФормы Из РеквизитыФормы Цикл
		Попытка
			СтароеЗначение = УправлениеТелефониейСервер.ПолучитьНастройкуТелефонииПользователя(РеквизитФормы.Имя);
			Если НЕ СтароеЗначение = ЭтаФорма[РеквизитФормы.Имя] Тогда
				УправлениеТелефониейСервер.УстановитьНастройкуТелефонииПользователя(РеквизитФормы.Имя, ЭтаФорма[РеквизитФормы.Имя]);
				Модифицированность = Истина;
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаМенеджеру(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеТелефониейКлиент.ПриЗавершенииРаботыСистемы();
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти
